* 测试

#+BEGIN_SRC scheme 
  (define (a-plus-abs-b a b)
    ((if (> b 0) + -) a b))

  (a-plus-abs-b 3 -3)
#+END_SRC

#+RESULTS:
: 6
